{
  "basics": {
    "name": "Nizar Khalife",
    "label": "Software Engineer & Educator",
    "email": "k.halife.n.izar@gmail.com",
    "url": "https://nizaroni.pizza",
    "summary": "Puerto Rican senior software engineer and educator with over 15 years of industry experience. I'm mostly interested in JavaScript, but have used many other languages. My passion is teaching people about computer science. I try to practice kindness in everything I do. A joke or two can't hurt either.",
    "location": {
      "city": "Paris",
      "countryCode": "FR"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "nizaroni",
        "url": "https://twitter.com/nizaroni"
      }, {
        "network": "GitHub",
        "username": "nizaroni",
        "url": "https://github.com/nizaroni"
      }
    ]
  },
  "work": [
    {
      "company": "Ironhack",
      "position": "Education Lead",
      "website": "https://ironhack.com",
      "startDate": "2019-03-25",
      "summary": "Within Ironhack, I transitioned to working for the central Education Team as Education Lead. In this role, I've acted as the manager for the people who help make our curricula the best they can possibly be. I've also participated in hiring people above and below me to achieve greater success for our instructors and students. My long tenure at Ironhack has given me unique perspective to help the team tackle problems.",
      "highlights": [
        "Grew the central Education Team from 3 people to 9",
        "Planned the first Education Summit with instructors from all campuses",
        "Supported the team through 4 leadership changes"
      ]
    }, {
      "company": "Ironhack",
      "position": "WebDev Lead Instructor",
      "website": "https://ironhack.com",
      "startDate": "2014-10-27",
      "endDate": "2019-03-22",
      "summary": "Ironhack is an international school that provides intensive courses in tech skills. As Lead Instructor, I taught Web development (HTML, CSS and JavaScript) to beginners looking to enter the tech industry. Between courses, I worked on improving the curriculum that's used by all our campuses. I also did speaking engagements as a representative of Ironhack.",
      "highlights": [
        "Taught 17 full-time WebDev bootcamps",
        "Personally trained over 200 students",
        "Helped transition from Ruby on Rails curriculum to Node.js and Angular",
        "Created training materials for new WebDev instructors"
      ]
    }, {
      "company": "Freelance",
      "position": "Software Engineer",
      "startDate": "2014-08-09",
      "endDate": "2014-12-24",
      "summary": "Took on freelance Web development projects on a contract basis."
    }, {
      "company": "Nobox",
      "position": "Software Engineer",
      "website": "https://nobox.com",
      "startDate": "2011-03-28",
      "endDate": "2014-08-08",
      "summary": "In this digital marketing agency, I architected and developed Web applications and services (usually with heavy social network integrations). Learned and used various technology stacks along the way: Node.js, Python (Django), PHP (CodeIgniter, Symfony, Laravel), Redis, MongoDB, MySQL and PostgreSQL. Also wrote a ton of browser JavaScript. Most of the time I was the project lead but I also worked often as part of a team. Additionally, I engaged certain clients directly and enjoyed a friendly relationship with them. It was a very fast paced and intensive learning experience.",
      "highlights": [
        "Developed over a dozen production Web projects",
        "Worked with clients such as Samsung, Mozilla, PlayStation and Discovery"
      ]
    }, {
      "company": "Kolapse",
      "position": "Web Developer",
      "website": "http://www.linkedin.com/company/kolapse-interactive",
      "startDate": "2011-01-24",
      "endDate": "2011-03-25",
      "summary": "Kolapse was a small Web development shop in Puerto Rico. There I developed Web applications for clients using PHP (with CodeIgniter or raw PHP), MySQL and JavaScript on the browser. It was at Kolapse that I experimented with social network integrations for the first time. I worked there until they were acquired by Nobox.",
      "highlights": [
        "Introduced version control (Git) into the team's workflow"
      ]
    }, {
      "company": "Sieve Analytics",
      "position": "iOS Developer & Research Assistant",
      "website": "https://www.sieve-analytics.com/",
      "startDate": "2009-01-17",
      "endDate": "2010-10-19",
      "summary": "Formerly known as ARBIMON, Sieve Analytics is an acoustic monitoring project. Designed and developed an iOS app that enabled the use of iPod touch devices as low-power recorders that capture audio on a configurable schedule. The app then sends the recordings to a server via antenna for audio analysis. As a research assistant I also supported my colleagues in solving problems in other areas of the project such as databases, version control, server scripting and configuration.",
      "highlights": [
        "Developed an iOS app that enabled recording of animals in the wild",
        "Over 1,000,000 recordings gathered",
        "Wrote comprehensive app user guide for biologists",
        "Introduced version control (Subversion) into the team's workflow"
      ]
    }, {
      "company": "University of Puerto Rico",
      "position": "Web Developer & Webmaster",
      "website": "http://dtaa.uprrp.edu",
      "startDate": "2007-07-01",
      "endDate": "2008-12-18",
      "summary": "Added and edited content in the university's Web site. Developed my first two real Web applications in a voting system for student council elections and a public campus crime log (both using PHP, MySQL and browser JavaScript).",
      "highlights": [
        "Developed voting system for student body council",
        "Developed public campus crime log that is still in use today (http://uprrp.edu/crimelog/)",
        "First (painful) experiments with raw browser HTTP requests and DOM APIs"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Puerto Rico",
      "startDate": "2004-08-01",
      "endDate": "2010-06-30",
      "area": "Computer Science",
      "studyType": "Bachelor's Degree"
    }
  ],
  "skills": [
    {
      "name": "Front-end Web Development",
      "keywords": [
        "JavaScript",
        "HTML",
        "CSS",
        "Angular",
        "React",
        "Tooling"
      ]
    }, {
      "name": "Back-end Web Development",
      "keywords": [
        "Node.js",
        "Ruby",
        "PHP",
        "Python",
        "Databases",
        "API Design",
        "Deployment"
      ]
    }, {
      "name": "Developer Tools",
      "keywords": [
        "Terminal",
        "Git",
        "GitHub",
        "Browser Developer Tools",
        "Editors and Plugins"
      ]
    }, {
      "name": "Teaching",
      "keywords": [
        "Curriculum Development",
        "Lesson Planning",
        "Classroom Management",
        "Learner Engagement",
        "Patience",
        "Empathy"
      ]
    }, {
      "name": "Public Speaking",
      "keywords": [
        "Talks",
        "Events",
        "Workshops"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native"
    }, {
      "language": "Spanish",
      "fluency": "Native"
    }, {
      "language": "French",
      "fluency": "Intermediate (B1)"
    }
  ]
}
